In [4]:
import pandas as pd

print(pd.__version__)

import numpy as np
import pandas as pd

2.3.3

In [5]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0  0.121456 -0.570236       NaN -1.189133
1      1       NaN  0.023198  0.947844 -2.216767
2      2 -1.133116  0.439983 -0.959728 -0.554342
3      3       NaN  0.750771       NaN       NaN
4      4  0.502734       NaN -0.559741 -0.070017

In [6]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0  0.121456 -0.570236       NaN -1.189133
1  1       NaN  0.023198  0.947844 -2.216767
2  2 -1.133116  0.439983 -0.959728 -0.554342
3  3       NaN  0.750771       NaN       NaN
4  4  0.502734       NaN -0.559741 -0.070017

In [7]:
df_backup = df.copy(deep=True)

In [8]:
df = df.dropna(axis='columns') 
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

In [9]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

   Z         A         B         C         D
2  2 -1.133116  0.439983 -0.959728 -0.554342
5  5 -0.488961  0.376860  0.029570  1.073082
6  6  0.097885 -0.783774  1.190608 -0.352751
7  7  0.694843  0.654446  0.642751  1.134049
8  8 -1.034488  0.156299 -1.600104 -1.595364

In [10]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.233333
B    0.300000
C    0.200000
D    0.200000
dtype: float64

In [11]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z
0  0
1  1
2  2
3  3
4  4